{
        "Introduction": "Hi, nice to meet you.#$b#You probably already met my sister Veronica, but I'm Robin.#$b#I actually own the carpentry shop, but Veronica's been helping me out while I was taking an extended vacation.$4",
		"FlowerDance_Accept": "Hmm...$2#$b#Yes, actually, that sounds nice. I haven't danced for awhile.$9",
		//check dialogue commands below to make sure they work
		"FlowerDance_Accept_Spouse": "Of course, I love dancing with you.$h#$b#Even if it is a little embarrassing to do in public.$7#$b#${Still, I feel so lucky to have such a handsome husband who enjoys dancing with me.$6^Still, I feel so lucky to have such a beautiful wife who enjoys dancing with me.$6^Still, I feel so lucky to have such an amazing partner who enjoys dancing with me.$6}$",
		"FlowerDance_Decline": "I... No thank you, I don't think I'm ready for that yet.",//Was "danceRejection" pre 1.6
        "divorced": "Would you like me to build you a coffin?",
        "dumped_Girls": "You won't care if I find other suitors for myself, will you?",
        "breakUp": "I was afraid this was too good to be true. I guess it was.$s",
        "secondChance_Girls": "Fine, I guess we can work it out.",
		"AcceptBirthdayGift_Positive": "This looks delicious! Thanks, @.$1",
		"AcceptBirthdayGift_Negative": "Yeah, this is, uh, great.$2",
		"AcceptGift_(O)StardropTea": "Wait a sec... you're giving me this? What a special treat! Thank you.",
		"AcceptGift_(O)Book_Woodcutting": "What's this... 'Woody's Secret'? ... Um, what kind of book is this, @?$6#$b#Oh, it's about woodcutting! Hahaha... Oh yeah, I'm going to love this. Thanks!$4",// Changes if married, found in content.json
		"AcceptGift_(O)SkillBook_2": "Ah, 'Woodcutter's Weekly'... I was hoping to get my hands on the newest issue! They've got all the latest techniques in here!#$b#From one woodcutter to another... Thank you.$h",
		"AcceptGift_(O)224": "How did you know I've been craving this? Thanks so much, @.$h",//Spaghetti
		"AcceptGift_(O)426": "Oh, this will go perfect on the wonderful salads Leah makes!#$b#You can't beat something this fresh.#$b#Thanks, @.",//Goat Cheese | Changes if married, found in content.json
		// The below should work, but if not, the second text after $c is the original verison of this dialogue (starting with a "#$b#" originally).
		"AcceptGift_(O)636": "It smells great. I think I'll take a bite now.#$b#*munch*#$b#Wow, this peach is really juicy.#$c 0.3#Did you know that Veronica and I used to fight over peaches when we were kids? I let her win, at least most of the time, of course.#It's perfect. Thank you, @.$h",//Peach
		"GreenRain": "We have no idea if this rain is dangerous. Be careful out there!",
		"GreenRainFinished": "Looks like I was worried about nothing. What do I know anymore, huh?$s#If we have any other strange weather, it better be Purple Rain.$h",
		"GreenRain_2": "There's all kinds of good wood out there today. Better get chopping, huh?",
    	"divorced_Sebastian": "Sebastian's back in the basement... what happened between you two?$s",
		"divorced_Maru": "Maru was crying through the night... We're all devastated...$s",
		"married_Sebastian": "Oh, don't worry... these are tears of joy. I know Sebastian will be very happy on %farm Farm!$h",
		"married_Maru": "I'm so happy for you and Maru.$h#$b#And I'm sure I'll still see her often now that she lives a little closer!$0#$b#Don't worry, I won't be the mother-in-law that stops by every day.$u",
		"reject_865": "Veggie salt? Sounds good, but I don't need it.",
		"reject_866": "Hmm... when I think of flowers, I think of Evelyn. Maybe show this to her?",
		"MovieInvitation": "Ooh... Two tickets for tonight's show, huh? Sounds good! I'll meet you there.$h",
		"AcceptBouquet": "Oh.$6#$b# Of course I'll date you.$6#$b#*whispers*  I really like you, @...$7",
		"RejectBouquet_VeryLowHearts": "$c .5#Are you kidding me?$3#I don't have time for this.$3",
		"RejectBouquet_LowHearts": "Sorry, @.#$c 0.5#I'm not ready to have another relationship yet.$2#I'm not sure if, or even when, I'll be ready for that type of relationship again.$2",
		"RejectBouquet_Divorced": "Ugh, why? Is this some sick joke, @?$3",
		"RejectBouquet_NpcAlreadyMarried": "Haha. Good joke.$1#$b#Wait, you're serious? No. I am very happy with {0}.$3",
		"RejectGift_Divorced": "No thanks. Leave me alone, @.$3",
		"RejectMermaidPendant_NpcWithSomeoneElse": "Haha. Good joke.$1#$b#Wait, you're serious? No. I am very happy with {0}.$3",
		"RejectMermaidPendant_Divorced": "Hahahahaha!$h#$b#You chose to leave me. We're done. Don't bring up something this ridiculous ever again.#a",
		"RejectMermaidPendant_PlayerWithSomeoneElse": "I'm not going to be your mistress.$3#$b#If you don't have any carpentry related business, then it's best if you leave.",
		"RejectMermaidPendant_Under8Hearts": "I'm sorry, @, but no.$2",
		"RejectMermaidPendant_Under10Hearts": "I can't. Please, don't...$3#$b#Please, let's leave it at that.$2",
		"RejectMermaidPendant_Under10Hearts_AskedAgain": "Do you even listen to anything I say? I've already told you no.#$b#No amount of pleading will make a difference.$3",
		"SpouseStardrop": "Honey... You've made me so happy, I wanted to give you something special to show how much I love you.#$b#Emily also said it'd give you some extra stamina, though it could be an old wives' tell.$6#$b#Care to see if it's true?$9",
		"WipedMemory": "I feel like I've forgotten something important.#$b#But I'm not sure I care. Perhaps it was for the better. I feel lighter now.#$b#See you around, @.",
		//"WinterStar_GiveGift_Before_Spouse": "",
		//"WinterStar_GiveGift_After_Spouse": "",
		//"WinterStar_ReceiveGift": "",
		"Mon": "Have I told you that I built the carpentry shop from the ground up?#$e#It's definitely been the highlight of my career so far.",
    	"Mon6": "I'm itching to start a new project. I recently discovered a little secret out in the woods. Might be nice to build a cabin out there.",
    	"Mon10": "You know, I could be a real help on your farm.#$b#Maintain some fences, work on your buildings.#$b#And it wouldn't hurt that we'd get to wake up next to each other every morning.",
    	"Tue": "If you ever need any carpentry work done, just call me. I'd be more than happy to help out!",
    	"Tue4": "If you are friendly enough with Veronica, she'll probably teach you some of her skills.#$b#She's not as good as me, but she'll do.#$b#Of course I'd be happy to help you learn, but I'm busy at the moment.",
    	"Tue8": "After the divorce, I thought I was all alone. But the people in the Valley really came together and made me feel at home again.#$b#$2But something was still missing.#$b#A good friend like you!$1",
    	"Wed": "Hey there, @.#$e#I was just daydreaming about some new carpentry projects.#$e#Are you doing OK at your place? How's the woodwork in your cottage holding up?",
    	"Wed2": "Your grandpa was a sweet old man. It's sad that he passed, but I'm happy to know his farm is in good hands.",
    	"Wed6": "Something people don't know about your grandpa was that he used to grow a small grove of pumpkins on the farm.#$b#A few days before Spirit's Eve, large pumpkins would show up at the doorstep of all the kid's houses.#$b#Sebby tried to act \"cool,\" but he and Maru would end up laughing and giggling as they tried to decide what to carve.#$b# No one seems to realize it, but Sebby is actually a very adoring big brother towards Maru.$1",
    	"Wed10": "I always thought my last kid would be Maru. But...#$b#I could see having another kid someday. What about you?$7",
    	"Thu": "Hi there, @!#$e#I was just mulling over which types of wood and trees I like the most.#$b#My favorite wood would have to be oak. My favorite tree though would actually be a cherry blossom.
    	#$q 7008/7009 woodquestion_followup#Do you have a favorite wood?
    	#$r 7008 45 fav_oak#I like oak too!
    	#$r 7008 40 fav_cherry#I really enjoy cherry.
    	#$r 7008 35 fav_pine#Pine is fine!
    	#$r 7009 -5 fav_fourofour#There's different types of wood?
    	#$r 7009 0 fav_none#No, not really.",
    	"woodquestion_followup": "$p 7008 #If you ever want me to make some furniture, I'll make sure to use your favorite wood!$1|Sorry for rambling. Sometimes I think people have as much of a passion for carpentry as I do.$6",
    	"fav_oak": "You have excellent tastes!$1",
    	"fav_cherry": "I am quite fond of cherry, too.$1",
    	"fav_pine": "Pine is too soft of a wood for me, but I can see the appeal.",
    	"fav_fourofour": "Where did you go to school?$3",
    	"fav_none": "Oh yeah, probably not. Huh, maybe it's just a carpenter thing.$6",
    	"Thu2": "I know I said I like oak wood. It's the most enjoyable to work with.#$b#But I love a dark, cherry stain. It always looks incredible. If you ever want me to stain some of your furniture, let me know, I'd be happy to!#$b# Especially if I can pick out the stain myself.$1",
    	"Thu4_inlaw_Maru": "Hi, @. How are things with Maru and the farm?#$b#Will you need me to be constructing any extra rooms, or perhaps a custom crib?$1#$e#As long as you two are happy, then that's enough for me.$0",
    	"Thu6": "A lot of people seem to think goat cheese is disgusting.#$b#It's a shame too. Just because it comes from a goat doesn't mean it's disgusting.#$b#You're really missing out if you won't at least give it a try.",
    	"Thu10": "I'm your Peach?$7#$b#$0I think you can be really \"cheesy\" sometimes.#$b#Oh come on, that was at least a little funny.$9",
    	"Fri": "You've met my son Sebastian, right? #$e#He's a little shy, but I'm sure he'll warm up to you if you're nice to him. He could probably use another friend right now.",
    	"Fri4": "Even though we're divorced, Demetrius and Sebastian still have a good relationship.#$b#I'm happy for them. It's nice to know that they still have a familial bond.",
    	"Fri8": "Maru has been talking about working at the clinic a little too much for my tastes.#$b#Just between you and me, I don't think that's what she really wants. I hope she'll consider becoming an engineer instead.#$b#Maybe her and Sebastian will build a working robot one day!",
    	"Sat": "The mountains are such a beautiful area, don't you think?#$e#I love the fresh air up there.",
    	"Sat4": "Do you think Sebastian would like a crab beanie? Probably not, huh?#$e#I might have been too obsessed with a certain Mermaid a long time ago.",
    	"Sat6": "Wood isn't the only thing I like. I enjoy the outdoors and I'm actually really fond of videogames, too.#$b#That's not something I tell a lot of people.",
    	"Sat8": "What kind of videogames do I like? Uh, probably not any you're familiar with.#$b#$6Well, dating sims and old school text games actually. Most people who find out make fun of me, but how can you not like setting up one pigeon on a date with another?",
    	"Sat10": "My dreams have changed over time. Nowadays, I guess what I want is...#$b#Well, you.$6#$b#My dream weekend would be lying on a blanket with you in front of the fire.$9",
    	"Sun": "I like Leah, but some of those \"vegetable\" concoctions she creates smell terrible!#$b#$4Don't tell her I said that.",
    	"Sun2": "Did you know that Sebastian almost burnt down our house one time? Left an old cigarette on his bed.",
    	"Sun6": "Hi, @! It's good to see you.#$e#You're a regular member of the community now, don't you think?",
    	"Sun10": "I'd like to build another house one day. A large one for you and me, with two guest bedrooms for Sebastian and Maru.#$b#I wonder if they'd be willing to spend some of the holidays with us. Would you be okay with that?",
    	"Fri_inlaw_Sebastian": "I miss my Sebby... he was always a little misunderstood, but I believed in him.",
    	"Fri4_inlaw_Sebastian": "Sebastian told me he's trying to quit smoking! I'm really proud of him. Seems you're a good influence. I'm glad that you two found each other.",
    	"summer_Mon": "Wood is a wonderful substance... it's versatile, cheap, strong, and each piece has its own unique character!",
    	"summer_Tue": "I really need some wood.#$b#$7I mean I need to go pick up some wood for Marnie's farm. There's a project I'm working on that needs to be finished before the Fall.",
    	"summer_Fri": "We're pretty insulated from the rest of the world here in Stardew Valley.#$e#It has its pros and cons.",
    	"fall_Mon": "#$1 RobinMaru#Maru likes gems. She uses them in her inventions.#$e#So how are you and Maru getting along?",
    	"fall_Wed_inlaw_Leah": "Take good care of Leah, @.#$b#The house is a little lonelier now without her around, but seeing her so happy with you makes up for it.",
    	"fall_Thu": "You're always welcome to visit, even if you have no reason to. !$h#$e#It can get pretty lonely in the cottage.",
    	"fall_Fri": "I used to not be happy about Linus living behind us, but now I think I understand him better.#$b#He really is a sweet, misunderstood man. Still, I wish he'd at least let me build him a tiny cabin. *sigh*",
    	"winter_Mon": "Hey, it's a perfect time of year to gather wood.#$e#Maybe you can collect enough to upgrade your house!",
    	"winter_Fri": "My parents were bewildered when I told them I wanted to be a carpenter.#$e#They were pretty old-fashioned.",
    	"winter_Fri_inlaw_Sebastian": "I think the farm life is really healthy for Sebby.",
    	"winter_Sat": "Everything looks still after a fresh snow. I miss living up in the mountains.$2",
    	"spring_12": "The egg festival is tomorrow. I finished working on Pierre's sales stand just in time.$4",
    	"spring_23": "I'm not sure if I'll go to the Flower Dance.#$b#Having to see \"him\" is hard enough, but I'd also feel a little awkward at my age if I'm invited to participate in the dance.",
    	"summer_9": "What kind of gift do you think I should get for Maru?#$b#I got it! I'll build her a rack to display some of her smaller inventions.",
    	"summer_10": "I've got to gather some firewood for the Luau tomorrow. Leah and I have been growing some vegetables we'll be adding to the pot. Of course they won't be as tasty as yours!",
    	"summer_19": "Just go away!$3#$e#. I'm sorry, that was rude, but today is not a good day for me$0.",
    	"summer_27": "It's strange, but when I see the Dance of the Moonlight Jellies, I always feel an inspiration to craft even greater projects.",
    	"fall_15": "I've heard it rumored that Pierre likes to cheat with his display.#$b#Of course, if the rumors about Lewis are true, you might not need to cheat to get ahead with yours.#$e#Good luck! Everything that you grow seems to be magical.#$b#It's hard to imagine how your display won't be a hit!",
    	"fall_26": "Maru and I built a few \"contraptions.\" It'll get a good scare out of anyone brave enough to step into that maze.#$b#Don't tell Maru, but I snuck in a couple ones she didn't help with. That'll give her a good scare too.",
    	"winter_10": "Sebastian likes to be alone for most of the day on his birthday. I wish he'd celebrate with us for more than a couple hours.",
    	"winter_15": "I've always wanted to build a boat. You could be my first passenger when I finish it!",
    	"winter_24": "Most people make the mistake that I want some new power tool for carpentry projects for the Feast.#$b#But all I really want is a cup of hot cocoa with a marshmallow, a warm crackling fire with the sweet aroma of the wood, and a blanket to curl up in.",
    	"winter_7": "Are you going to participate in the ice fishing contest tomorrow? I prefer to work on ice sculptures myself, I'd love it if you came to check out what I've made this year.#$e#I'll be cheering you on tomorrow!",
    	"forest_40_13": "I'd never cut it down, but I think this tree would make for some amazing wood to work with.#$e#Oh, pretend like you didn't hear that.$6",
    	"mountain_23_21": "I love the mountains. The fresh air and the view can't be beat!$1#$b#I also get to see Maru and Sebastian when I come up here.$0#$b#I miss living with them, but I think the way things are is probably for the best.$2",
    	"AnimalShop_14_16": "I come by each week to do some odd jobs on the farm for Marnie.#$b#Living nearby has made it much simpler to do, too!$4",
    	"Blacksmith_4_15": "Clint occasionally calls me over to do some odd jobs. Other weeks we just talk.#$b#*whispers* I think he's really lonely. Most of the jobs he wants me to do are things he could have taken care of with relative ease.$2",
    	"Town_49_24": "Oh, hey, @!#$b#I'm just looking over the old community center.#$b#I'm imagining what I could do to fix it up, if Joja doesn't get their grubby hands on it first. I can only work so fast.$3",
    	"Town_51_92": "I found a leftover egg from the egg hunt.#$b#Don't worry, it's not rotten, it's a plastic one.#$e#Let's open it up and see what's inside. Oh, just a slip of paper. I wonder if Pierre hid it for Abigail to find?#$e#Well good night!$1#$e#Huh? What did it say? Seemed like gibberish to me, maybe it wasn't Pierre but one of the Shadow People.#$e#It said: \"Time to Close For now. a Vacant Shell Finds no peace.\"$2",
        
}